# <center> DATA WRANGLING </center>

1. Import libraries

In [3]:
import seaborn as sns 
import matplotlib.pyplot as plt 
import numpy as np 
import pandas as pd

In [8]:
boat=sns.load_dataset("titanic")
boat

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [48]:
ks1=boat
ks2=boat

In [12]:
boat.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [15]:
# Simple Operations (Math Operators)
(boat['age']+1).head(10)

0    23.0
1    39.0
2    27.0
3    36.0
4    36.0
5     NaN
6    55.0
7     3.0
8    28.0
9    15.0
Name: age, dtype: float64

In [18]:
(boat['fare']+1).head(10)

0     8.2500
1    72.2833
2     8.9250
3    54.1000
4     9.0500
5     9.4583
6    52.8625
7    22.0750
8    12.1333
9    31.0708
Name: fare, dtype: float64

In [20]:
(boat['pclass']+1).head(10)

0    4
1    2
2    4
3    2
4    4
5    4
6    2
7    4
8    4
9    3
Name: pclass, dtype: int64

In [22]:
(boat['survived']+1).head(10)

0    1
1    2
2    2
3    2
4    1
5    1
6    1
7    1
8    2
9    2
Name: survived, dtype: int64

# Dealing with missing values

In [24]:
boat.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [33]:
# use drop.na method
print(boat.shape)
boat.dropna(subset=['deck'], axis=0, inplace=True)

(203, 15)

In [34]:
boat.isnull().sum()

survived        0
pclass          0
sex             0
age            19
sibsp           0
parch           0
fare            0
embarked        2
class           0
who             0
adult_male      0
deck            0
embark_town     2
alive           0
alone           0
dtype: int64

In [36]:
print(boat.shape)
boat.dropna(subset=['age'], axis=0, inplace=True)

(184, 15)

In [38]:
boat.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
dtype: int64

In [46]:
# to drop na
boat.dropna()
# To update the data
boat.dropna().isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
deck           0
embark_town    0
alive          0
alone          0
dtype: int64

In [49]:
boat.shape

(184, 15)

In [51]:
ks1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
dtype: int64

In [53]:
ks2.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
dtype: int64

# Replacing missing values with the average of that column

In [55]:
mean=ks1['age'].mean()
mean

35.77945652173913

In [58]:
ks1['age']=ks1['age'].replace(np.nan, mean)

In [60]:
ks1.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       2
class          0
who            0
adult_male     0
deck           0
embark_town    2
alive          0
alone          0
dtype: int64

In [63]:
boat.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [65]:
ks1.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [72]:
boat['survived']=boat['survived'].astype['float64']
boat.dtypes

TypeError: 'method' object is not subscriptable

convet age into years

In [78]:
ks1['age']=ks1['age']*365
ks1.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,3.279696e+19,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,3.020773e+19,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,4.660621e+19,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,3.452312e+18,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,5.005852e+19,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
21,1,2,male,2.934465e+19,0,0,13.0000,S,Second,man,True,D,Southampton,yes,True
23,1,1,male,2.416618e+19,0,0,35.5000,S,First,man,True,A,Southampton,yes,True
27,0,1,male,1.639848e+19,3,2,263.0000,S,First,man,True,C,Southampton,no,False
52,1,1,female,4.229082e+19,1,0,76.7292,C,First,woman,False,D,Cherbourg,yes,False
54,0,1,male,5.610007e+19,0,1,61.9792,C,First,man,True,B,Cherbourg,no,False

In [81]:
ks4=boat[["age in days", 'fare']]
ks4.head()

KeyError: "['age in days'] not in index"